>>SOURCE FORMAT IS FREE
       IDENTIFICATION DIVISION.
       PROGRAM-ID. ADJUST-MODULE-COUNT.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       LINKAGE SECTION.
       01 ADJUST-MODULE-COUNT-COUNT PIC S9(9).
       01 ADJUST-MODULE-COUNT-DELTA PIC S9(9).
       PROCEDURE DIVISION USING ADJUST-MODULE-COUNT-COUNT
            ADJUST-MODULE-COUNT-DELTA.
       ADJUST-MODULE-COUNT.
           COMPUTE ADJUST-MODULE-COUNT-COUNT = ADJUST-MODULE-COUNT-COUNT + ADJUST-MODULE-COUNT-DELTA.
           GOBACK.
       CBLC-EX-CLEAR-PAYLOAD.
           EXIT.

           GOBACK.

       END PROGRAM ADJUST-MODULE-COUNT.
