       IDENTIFICATION DIVISION.
       PROGRAM-ID. MESSAGE-SHOWCASE-CONSTANTS.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 RESERVE-TARGET PIC S9(9) VALUE 600000.
       01 EARNED-PREMIUM PIC S9(9) VALUE 480000.
       01 TITLE.
          05 TITLE-LEN PIC 9(4) COMP VALUE 0.
          05 TITLE-CAP PIC 9(4) COMP VALUE 0.
          05 TITLE-PTR USAGE POINTER VALUE NULL.
       01 TITLE-BUF BASED PIC X(15).
       01 NOTE.
          05 NOTE-LEN PIC 9(4) COMP VALUE 0.
          05 NOTE-CAP PIC 9(4) COMP VALUE 0.
          05 NOTE-PTR USAGE POINTER VALUE NULL.
       01 NOTE-BUF BASED PIC X(16).
       01 TITLE-LENGTH PIC S9(9).
       01 NOTE-LENGTH PIC S9(9).
       PROCEDURE DIVISION.
MAIN.
           STOP RUN.

       END PROGRAM MESSAGE-SHOWCASE-CONSTANTS.

