       IDENTIFICATION DIVISION.
       PROGRAM-ID. MESSAGE-SHOWCASE-STAGE-COUNTER.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
MAIN.
           STOP RUN.

       END PROGRAM MESSAGE-SHOWCASE-STAGE-COUNTER.

