       IDENTIFICATION DIVISION.
       PROGRAM-ID. MESSAGE-SHOWCASE-STAGE-COUNTER-IMPL.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 STAGECOUNTER-ADD-DELTA PIC S9(9).
       PROCEDURE DIVISION.
MAIN.
           STOP RUN.

       END PROGRAM MESSAGE-SHOWCASE-STAGE-COUNTER-IMPL.

