       IDENTIFICATION DIVISION.
       PROGRAM-ID. STAGE-COUNTER-IMPL.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 STAGECOUNTER-ADD-DELTA PIC S9(9).
       PROCEDURE DIVISION.
MAIN.
           STOP RUN.

       END PROGRAM STAGE-COUNTER-IMPL.

