       IDENTIFICATION DIVISION.
       PROGRAM-ID. STAGE-COUNTER.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
MAIN.
           STOP RUN.

       END PROGRAM STAGE-COUNTER.

