       IDENTIFICATION DIVISION.
       PROGRAM-ID. PRINT-STAGE-TOTAL.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 STAGE-TOTAL PIC S9(9).
       LINKAGE SECTION.
       01 PRINT-STAGE-TOTAL-LEFT PIC S9(9).
       01 PRINT-STAGE-TOTAL-RIGHT PIC S9(9).
       PROCEDURE DIVISION USING PRINT-STAGE-TOTAL-LEFT PRINT-STAGE-TOTAL-RIGHT.
       PRINT-STAGE-TOTAL.
           COMPUTE STAGE-TOTAL = PRINT-STAGE-TOTAL-LEFT + PRINT-STAGE-TOTAL-RIGHT.
           DISPLAY "Parameterized import value".
           DISPLAY STAGE-TOTAL.
           GOBACK.

       END PROGRAM PRINT-STAGE-TOTAL.
