       IDENTIFICATION DIVISION.
       PROGRAM-ID. PRINT-STAGE.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
       PRINT-STAGE.
           DISPLAY "Function call OK".
           GOBACK.

       END PROGRAM PRINT-STAGE.
