>>SOURCE FORMAT IS FREE
       IDENTIFICATION DIVISION.
       PROGRAM-ID. CBLC-STRCMP.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 F-INDEX PIC S9(9) COMP-5.
       01 F-LIMIT PIC S9(9) COMP-5.
       01 F-RESULT PIC S9(9) COMP-5.
       01 CBLC-PTR-CURSOR USAGE POINTER VALUE NULL.
       01 CBLC-PTR-OFFSET PIC S9(9) VALUE 0.
       01 CBLC-PTR-CHAR BASED PIC X.
       01 CBLC-PTR-INT BASED PIC S9(9).
       01 CBLC-PTR-INT-PTR BASED USAGE POINTER.
       01 CBLC-PTR-CHAR-2 BASED PIC X.
       01 CBLC-PTR-INT-2 BASED PIC S9(9).
       01 CBLC-PTR-INT-PTR-2 BASED USAGE POINTER.
       LINKAGE SECTION.
       01 F-FIRST-CHAR PIC X(255).
       01 F-FIRST-LENGTH PIC S9(9) COMP-5.
       01 F-SECOND-CHAR PIC X(255).
       01 F-SECOND-LENGTH PIC S9(9) COMP-5.
       01 CBLC-RETURN-F PIC S9(9).
       PROCEDURE DIVISION USING BY REFERENCE F-FIRST-CHAR
            BY VALUE F-FIRST-LENGTH BY REFERENCE F-SECOND-CHAR
            BY VALUE F-SECOND-LENGTH BY REFERENCE CBLC-RETURN-F.
       F.
           COMPUTE F-RESULT = 0.
           COMPUTE F-INDEX = 0.
           COMPUTE F-LIMIT = F-FIRST-LENGTH.
           IF F-SECOND-LENGTH < F-LIMIT
           COMPUTE F-LIMIT = F-SECOND-LENGTH
           END-IF.
           PERFORM UNTIL NOT (F-INDEX < F-LIMIT)
           IF F-FIRST-CHAR(F-INDEX + 1:1) < F-SECOND-CHAR(F-INDEX + 1:1)
           COMPUTE F-RESULT = - 1
           COMPUTE F-INDEX = F-LIMIT
           ELSE
           IF F-FIRST-CHAR(F-INDEX + 1:1) > F-SECOND-CHAR(F-INDEX + 1:1)
           COMPUTE F-RESULT = 1
           COMPUTE F-INDEX = F-LIMIT
           ELSE
           COMPUTE F-INDEX = F-INDEX + 1
           END-IF
           END-IF
           END-PERFORM.
           IF F-RESULT = 0
           IF F-FIRST-LENGTH < F-SECOND-LENGTH
           COMPUTE F-RESULT = - 1
           ELSE
           IF F-FIRST-LENGTH > F-SECOND-LENGTH
           COMPUTE F-RESULT = 1
           END-IF
           END-IF
           END-IF.
           MOVE F-RESULT TO CBLC-RETURN-F.
           GOBACK.
           GOBACK.

       END PROGRAM CBLC-STRCMP.

