       IDENTIFICATION DIVISION.
       PROGRAM-ID. MAIN.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 GREETING PIC X(32).
       PROCEDURE DIVISION.
MAIN.
           MOVE "HELLO FROM CBL-C" TO GREETING
           DISPLAY GREETING
           STOP RUN.

