       IDENTIFICATION DIVISION.
       PROGRAM-ID. CBLC-STRCPY.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 IDX PIC 9(9) VALUE 000000000.
       01 SOURCE-LIMIT PIC 9(9) VALUE 000000000.
       01 DEST-LIMIT PIC 9(9) VALUE 000000000.
       LINKAGE SECTION.
       01 LNK-DESTINATION PIC X(255).
       01 LNK-DESTINATION-LENGTH PIC S9(9) COMP-5.
       01 LNK-SOURCE PIC X(255).
       01 LNK-SOURCE-LENGTH PIC S9(9) COMP-5.
       01 LNK-STATUS PIC 9(9).
       PROCEDURE DIVISION USING BY REFERENCE LNK-DESTINATION
           BY VALUE LNK-DESTINATION-LENGTH BY REFERENCE LNK-SOURCE
           BY VALUE LNK-SOURCE-LENGTH BY REFERENCE LNK-STATUS.
       MAIN.
           MOVE 0 TO LNK-STATUS.
           MOVE LNK-DESTINATION-LENGTH TO DEST-LIMIT.
           IF DEST-LIMIT > 255
               MOVE 255 TO DEST-LIMIT
           END-IF.
           MOVE LNK-SOURCE-LENGTH TO SOURCE-LIMIT.
           IF SOURCE-LIMIT > 255
               MOVE 255 TO SOURCE-LIMIT
           END-IF.
           MOVE 0 TO IDX.
           PERFORM VARYING IDX FROM 1 BY 1 UNTIL IDX > DEST-LIMIT
               MOVE SPACE TO LNK-DESTINATION(IDX:1)
           END-PERFORM.
           MOVE 0 TO IDX.
           PERFORM VARYING IDX FROM 1 BY 1 UNTIL IDX > SOURCE-LIMIT
               IF IDX > DEST-LIMIT
                   MOVE 1 TO LNK-STATUS
                   EXIT PERFORM
               END-IF
               MOVE LNK-SOURCE(IDX:1) TO LNK-DESTINATION(IDX:1)
           END-PERFORM.
           GOBACK.
       END PROGRAM CBLC-STRCPY.
