>>SOURCE FORMAT IS FREE
       IDENTIFICATION DIVISION.
       PROGRAM-ID. CBLC-ABS.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 F-RESULT PIC S9(18) COMP-5.
       01 F-ERROR.
       05 F-ERROR-CODE PIC S9(9).
       01 CBLC-EX-PAYLOAD-OVERFLOW-ERROR.
       05 CBLC-EX-PAYLOAD-OVERFLOW-ERROR-CODE PIC S9(9).
       LINKAGE SECTION.
       01 CBLC-EX-CONTEXT.
          05 CBLC-EX-ACTIVE PIC X.
          05 CBLC-EX-MATCHED PIC X.
          05 CBLC-EX-TYPE-ID PIC 9(10) COMP-5.
          05 CBLC-EX-DYNAMIC-TYPE-ID PIC 9(10) COMP-5.
          05 CBLC-EX-PAYLOAD-SIZE PIC 9(9) COMP-5.
          05 CBLC-EX-PAYLOAD-OWNER PIC X.
          05 CBLC-EX-SOURCE-FILE-ID PIC 9(10) COMP-5.
          05 CBLC-EX-SOURCE-LINE PIC 9(9) COMP-5.
          05 CBLC-EX-SOURCE-COLUMN PIC 9(9) COMP-5.
          05 CBLC-EX-RAISING PIC X.
          05 CBLC-EX-CLEANING PIC X.
          05 CBLC-EX-SECONDARY-TYPE-ID PIC 9(10) COMP-5.
          05 CBLC-EX-SECONDARY-SOURCE-LINE PIC 9(9) COMP-5.
          05 CBLC-EX-SECONDARY-SOURCE-COLUMN PIC 9(9) COMP-5.
          05 CBLC-EX-INT-PAYLOAD PIC S9(9).
          05 CBLC-EX-STRING.
             10 CBLC-EX-STRING-LEN PIC 9(4) COMP.
             10 CBLC-EX-STRING-BUF PIC X(256).
       01 F-OPERAND PIC S9(18) COMP-5.
       01 CBLC-RETURN-F PIC S9(18).
       PROCEDURE DIVISION USING CBLC-EX-CONTEXT
            BY REFERENCE F-OPERAND BY REFERENCE CBLC-RETURN-F.
       F.
           COMPUTE F-RESULT = F-OPERAND.
           IF F-RESULT < 0
           COMPUTE F-RESULT = 0 - F-RESULT
           IF F-RESULT < 0
           COMPUTE F-ERROR-CODE = 1
           IF CBLC-EX-RAISING = 'Y' OR CBLC-EX-CLEANING = 'Y'
               MOVE 700023052 TO CBLC-EX-SECONDARY-TYPE-ID
               MOVE 48 TO CBLC-EX-SECONDARY-SOURCE-LINE
               MOVE 13 TO CBLC-EX-SECONDARY-SOURCE-COLUMN
               PERFORM CBLC-TERMINATE
           END-IF
           MOVE 'Y' TO CBLC-EX-RAISING
           MOVE F-ERROR TO CBLC-EX-PAYLOAD-OVERFLOW-ERROR
           MOVE 4 TO CBLC-EX-PAYLOAD-SIZE
           MOVE 700023052 TO CBLC-EX-TYPE-ID
           MOVE 700023052 TO CBLC-EX-DYNAMIC-TYPE-ID
           MOVE 48 TO CBLC-EX-SOURCE-LINE
           MOVE 393647456 TO CBLC-EX-SOURCE-FILE-ID
           MOVE 13 TO CBLC-EX-SOURCE-COLUMN
           MOVE 'Y' TO CBLC-EX-PAYLOAD-OWNER
           MOVE 'Y' TO CBLC-EX-ACTIVE
           MOVE 'N' TO CBLC-EX-RAISING
           GOBACK
           END-IF
           END-IF.
           MOVE F-RESULT TO CBLC-RETURN-F.
           GOBACK.
           GOBACK.

       CBLC-TERMINATE.
           DISPLAY "Fatal CBL-C double exception"
           DISPLAY "Original exception type: " CBLC-EX-TYPE-ID
           DISPLAY "Original exception file ID: " CBLC-EX-SOURCE-FILE-ID
           DISPLAY "Original exception line: " CBLC-EX-SOURCE-LINE
           DISPLAY "Original exception column: " CBLC-EX-SOURCE-COLUMN
           DISPLAY "Secondary exception type: " CBLC-EX-SECONDARY-TYPE-ID
           DISPLAY "Secondary exception line: " CBLC-EX-SECONDARY-SOURCE-LINE
           DISPLAY "Secondary exception column: " CBLC-EX-SECONDARY-SOURCE-COLUMN
           STOP RUN.

       END PROGRAM CBLC-ABS.

