       IDENTIFICATION DIVISION.
       PROGRAM-ID. CBLC-STRLEN-STRING.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       LINKAGE SECTION.
       01 LNK-SOURCE.
          05 LNK-SOURCE-LEN PIC 9(4) COMP.
          05 LNK-SOURCE-BUF PIC X(255).
       01 LNK-RESULT PIC 9(9).
       PROCEDURE DIVISION USING BY REFERENCE LNK-SOURCE
           BY REFERENCE LNK-RESULT.
       MAIN.
           MOVE LNK-SOURCE-LEN TO LNK-RESULT.
           GOBACK.
       END PROGRAM CBLC-STRLEN-STRING.
