       IDENTIFICATION DIVISION.
       PROGRAM-ID. CBLC-STRCPY-STRING.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 IDX PIC 9(9) VALUE 000000000.
       01 SOURCE-LIMIT PIC 9(9) VALUE 000000000.
       01 COPY-LIMIT PIC 9(9) VALUE 000000000.
       LINKAGE SECTION.
       01 LNK-DESTINATION.
          05 LNK-DESTINATION-LEN PIC 9(4) COMP.
          05 LNK-DESTINATION-BUF PIC X(255).
       01 LNK-SOURCE.
          05 LNK-SOURCE-LEN PIC 9(4) COMP.
          05 LNK-SOURCE-BUF PIC X(255).
       01 LNK-STATUS PIC 9(9).
       PROCEDURE DIVISION USING BY REFERENCE LNK-DESTINATION
           BY REFERENCE LNK-SOURCE BY REFERENCE LNK-STATUS.
       MAIN.
           MOVE 0 TO LNK-STATUS.
           MOVE LNK-SOURCE-LEN TO SOURCE-LIMIT.
           IF SOURCE-LIMIT > 255
               MOVE 255 TO SOURCE-LIMIT
               MOVE 1 TO LNK-STATUS
           END-IF.
           MOVE SOURCE-LIMIT TO COPY-LIMIT.
           MOVE 0 TO LNK-DESTINATION-LEN.
           MOVE 0 TO IDX.
           PERFORM VARYING IDX FROM 1 BY 1 UNTIL IDX > 255
               MOVE SPACE TO LNK-DESTINATION-BUF(IDX:1)
           END-PERFORM.
           MOVE 0 TO IDX.
           PERFORM VARYING IDX FROM 1 BY 1 UNTIL IDX > COPY-LIMIT
               MOVE LNK-SOURCE-BUF(IDX:1) TO LNK-DESTINATION-BUF(IDX:1)
           END-PERFORM.
           MOVE COPY-LIMIT TO LNK-DESTINATION-LEN.
           GOBACK.
       END PROGRAM CBLC-STRCPY-STRING.
