       IDENTIFICATION DIVISION.
       PROGRAM-ID. CBLC-DATE-DURATION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-DIFF PIC S9(9) COMP-5.
       LINKAGE SECTION.
       01 LNK-START-SERIAL PIC S9(9) COMP-5.
       01 LNK-END-SERIAL PIC S9(9) COMP-5.
       01 LNK-DURATION PIC S9(9) COMP-5.
       01 LNK-COMPARISON PIC S9 COMP-5.
       01 LNK-STATUS PIC 9.
       PROCEDURE DIVISION USING BY REFERENCE LNK-START-SERIAL
           BY REFERENCE LNK-END-SERIAL BY REFERENCE LNK-DURATION
           BY REFERENCE LNK-COMPARISON BY REFERENCE LNK-STATUS.
       MAIN.
           MOVE 0 TO LNK-STATUS.
           MOVE 0 TO LNK-DURATION.
           MOVE 0 TO LNK-COMPARISON.
           MOVE LNK-END-SERIAL TO WS-DIFF.
           SUBTRACT LNK-START-SERIAL FROM WS-DIFF.
           IF WS-DIFF < 0
               MOVE -1 TO LNK-COMPARISON
               MULTIPLY -1 BY WS-DIFF GIVING LNK-DURATION
           ELSE
               IF WS-DIFF > 0
                   MOVE 1 TO LNK-COMPARISON
                   MOVE WS-DIFF TO LNK-DURATION
               ELSE
                   MOVE 0 TO LNK-COMPARISON
                   MOVE 0 TO LNK-DURATION
               END-IF
           END-IF
           GOBACK.
       END PROGRAM CBLC-DATE-DURATION.
