       IDENTIFICATION DIVISION.
       PROGRAM-ID. CBLC-STRNLEN.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 IDX PIC 9(9) VALUE 000000000.
       01 DECLARED-LIMIT PIC 9(9) VALUE 000000000.
       01 REQUEST-LIMIT PIC 9(9) VALUE 000000000.
       LINKAGE SECTION.
       01 LNK-SOURCE PIC X(255).
       01 LNK-DECLARED-LENGTH PIC S9(9) COMP-5.
       01 LNK-REQUEST-LIMIT PIC S9(9) COMP-5.
       01 LNK-RESULT PIC 9(9).
       PROCEDURE DIVISION USING BY REFERENCE LNK-SOURCE
           BY VALUE LNK-DECLARED-LENGTH BY VALUE LNK-REQUEST-LIMIT
           BY REFERENCE LNK-RESULT.
       MAIN.
           MOVE 0 TO LNK-RESULT.
           MOVE 0 TO DECLARED-LIMIT.
           IF LNK-DECLARED-LENGTH > 0
               MOVE LNK-DECLARED-LENGTH TO DECLARED-LIMIT
           END-IF.
           IF DECLARED-LIMIT > 255
               MOVE 255 TO DECLARED-LIMIT
           END-IF.
           MOVE 0 TO REQUEST-LIMIT.
           IF LNK-REQUEST-LIMIT > 0
               MOVE LNK-REQUEST-LIMIT TO REQUEST-LIMIT
           END-IF.
           IF REQUEST-LIMIT > 255
               MOVE 255 TO REQUEST-LIMIT
           END-IF.
           IF REQUEST-LIMIT < DECLARED-LIMIT
               MOVE REQUEST-LIMIT TO DECLARED-LIMIT
           END-IF.
           MOVE 0 TO IDX.
           PERFORM VARYING IDX FROM 1 BY 1 UNTIL IDX > DECLARED-LIMIT
               IF LNK-SOURCE(IDX:1) = LOW-VALUE
                   EXIT PERFORM
               END-IF
               IF LNK-SOURCE(IDX:1) NOT = SPACE
                   MOVE IDX TO LNK-RESULT
               END-IF
           END-PERFORM.
           GOBACK.
       END PROGRAM CBLC-STRNLEN.
