       IDENTIFICATION DIVISION.
       PROGRAM-ID. CBLC-FLOOR.
       DATA DIVISION.
       LINKAGE SECTION.
       01 LNK-OPERAND USAGE COMP-2.
       01 LNK-RESULT USAGE COMP-2.
       01 LNK-STATUS PIC 9.
       PROCEDURE DIVISION USING BY REFERENCE LNK-OPERAND
           BY REFERENCE LNK-RESULT BY REFERENCE LNK-STATUS.
       MAIN.
           MOVE 0 TO LNK-STATUS.
           COMPUTE LNK-RESULT = FUNCTION INTEGER-PART(LNK-OPERAND).
           IF LNK-OPERAND NOT = LNK-RESULT
               MOVE 1 TO LNK-STATUS
               IF LNK-OPERAND < 0
                   COMPUTE LNK-RESULT = LNK-RESULT - 1
               END-IF
           END-IF.
           GOBACK.
       END PROGRAM CBLC-FLOOR.
