       IDENTIFICATION DIVISION.
       PROGRAM-ID. CBLC-SIN.
       DATA DIVISION.
       LINKAGE SECTION.
       01 LNK-OPERAND USAGE COMP-2.
       01 LNK-RESULT USAGE COMP-2.
       01 LNK-STATUS PIC 9.
       PROCEDURE DIVISION USING BY REFERENCE LNK-OPERAND
           BY REFERENCE LNK-RESULT BY REFERENCE LNK-STATUS.
       MAIN.
           MOVE 0 TO LNK-STATUS.
           COMPUTE LNK-RESULT = FUNCTION SIN(LNK-OPERAND)
               ON SIZE ERROR
                   MOVE 1 TO LNK-STATUS
                   MOVE 0 TO LNK-RESULT
           END-COMPUTE.
           GOBACK.
       END PROGRAM CBLC-SIN.
