>>SOURCE FORMAT IS FREE
       IDENTIFICATION DIVISION.
       PROGRAM-ID. CBLC-STRTOD.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 F-RESULT USAGE COMP-2.
       01 F-INDEX PIC S9(9) COMP-5.
       01 F-NEGATIVE PIC S9(9) COMP-5.
       01 F-STARTED PIC S9(9) COMP-5.
       01 F-SEEN-DIGIT PIC S9(9) COMP-5.
       01 F-SEEN-DOT PIC S9(9) COMP-5.
       01 F-DECIMAL-PLACES PIC S9(9) COMP-5.
       01 F-DIGIT PIC S9(9) COMP-5.
       01 F-ERROR.
       05 F-ERROR-CODE PIC S9(9).
       01 F-CURRENT PIC X(1).
       01 CBLC-EX-PAYLOAD-INVALID-ARGUMENT.
       05 CBLC-EX-PAYLOAD-INVALID-ARGUMENT-CODE PIC S9(9).
       01 CBLC-PTR-CURSOR USAGE POINTER VALUE NULL.
       01 CBLC-PTR-OFFSET PIC S9(9) VALUE 0.
       01 CBLC-PTR-CHAR BASED PIC X.
       01 CBLC-PTR-INT BASED PIC S9(9).
       01 CBLC-PTR-INT-PTR BASED USAGE POINTER.
       01 CBLC-PTR-CHAR-2 BASED PIC X.
       01 CBLC-PTR-INT-2 BASED PIC S9(9).
       01 CBLC-PTR-INT-PTR-2 BASED USAGE POINTER.
       LINKAGE SECTION.
       01 CBLC-EX-CONTEXT.
          05 CBLC-EX-ACTIVE PIC X.
          05 CBLC-EX-MATCHED PIC X.
          05 CBLC-EX-TYPE-ID PIC 9(10) COMP-5.
          05 CBLC-EX-DYNAMIC-TYPE-ID PIC 9(10) COMP-5.
          05 CBLC-EX-PAYLOAD-SIZE PIC 9(9) COMP-5.
          05 CBLC-EX-PAYLOAD-OWNER PIC X.
          05 CBLC-EX-SOURCE-FILE-ID PIC 9(10) COMP-5.
          05 CBLC-EX-SOURCE-LINE PIC 9(9) COMP-5.
          05 CBLC-EX-SOURCE-COLUMN PIC 9(9) COMP-5.
          05 CBLC-EX-RAISING PIC X.
          05 CBLC-EX-CLEANING PIC X.
          05 CBLC-EX-SECONDARY-TYPE-ID PIC 9(10) COMP-5.
          05 CBLC-EX-SECONDARY-SOURCE-LINE PIC 9(9) COMP-5.
          05 CBLC-EX-SECONDARY-SOURCE-COLUMN PIC 9(9) COMP-5.
          05 CBLC-EX-INT-PAYLOAD PIC S9(9).
          05 CBLC-EX-STRING.
             10 CBLC-EX-STRING-LEN PIC 9(4) COMP.
             10 CBLC-EX-STRING-BUF PIC X(256).
       01 F-SOURCE-CHAR PIC X(255).
       01 F-SOURCE-LENGTH PIC S9(9) COMP-5.
       01 CBLC-RETURN-F USAGE COMP-2.
       PROCEDURE DIVISION USING CBLC-EX-CONTEXT
            BY REFERENCE F-SOURCE-CHAR BY VALUE F-SOURCE-LENGTH
            BY REFERENCE CBLC-RETURN-F.
       F.
           COMPUTE F-RESULT = 0.
           COMPUTE F-INDEX = 0.
           COMPUTE F-NEGATIVE = 0.
           COMPUTE F-STARTED = 0.
           COMPUTE F-SEEN-DIGIT = 0.
           COMPUTE F-SEEN-DOT = 0.
           COMPUTE F-DECIMAL-PLACES = 0.
           PERFORM UNTIL NOT (F-INDEX < F-SOURCE-LENGTH AND F-STARTED = 0)
           MOVE F-SOURCE-CHAR(F-INDEX + 1:1) TO F-CURRENT
           IF F-CURRENT = ' '
           COMPUTE F-INDEX = F-INDEX + 1
           ELSE
           COMPUTE F-STARTED = 1
           END-IF
           END-PERFORM.
           IF F-STARTED = 1 AND F-SOURCE-CHAR(F-INDEX + 1:1) = '-'
           COMPUTE F-NEGATIVE = 1
           COMPUTE F-INDEX = F-INDEX + 1
           ELSE
           IF F-STARTED = 1 AND F-SOURCE-CHAR(F-INDEX + 1:1) = '+'
           COMPUTE F-INDEX = F-INDEX + 1
           END-IF
           END-IF.
           PERFORM UNTIL NOT (F-INDEX < F-SOURCE-LENGTH)
           MOVE F-SOURCE-CHAR(F-INDEX + 1:1) TO F-CURRENT
           IF F-CURRENT >= '0' AND F-CURRENT <= '9'
           COMPUTE F-DIGIT = FUNCTION ORD(F-CURRENT) - FUNCTION ORD('0')
           COMPUTE F-RESULT = F-RESULT * 10 + F-DIGIT
           COMPUTE F-SEEN-DIGIT = 1
           IF F-SEEN-DOT = 1
           COMPUTE F-DECIMAL-PLACES = F-DECIMAL-PLACES + 1
           END-IF
           COMPUTE F-INDEX = F-INDEX + 1
           ELSE
           IF F-CURRENT = '.' AND F-SEEN-DOT = 0
           COMPUTE F-SEEN-DOT = 1
           COMPUTE F-INDEX = F-INDEX + 1
           ELSE
           IF F-CURRENT = ' '
           COMPUTE F-INDEX = F-SOURCE-LENGTH
           ELSE
           COMPUTE F-ERROR-CODE = 1
           IF CBLC-EX-RAISING = 'Y' OR CBLC-EX-CLEANING = 'Y'
               MOVE 942785999 TO CBLC-EX-SECONDARY-TYPE-ID
               MOVE 110 TO CBLC-EX-SECONDARY-SOURCE-LINE
               MOVE 21 TO CBLC-EX-SECONDARY-SOURCE-COLUMN
               PERFORM CBLC-TERMINATE
           END-IF
           MOVE 'Y' TO CBLC-EX-RAISING
           MOVE F-ERROR TO CBLC-EX-PAYLOAD-INVALID-ARGUMENT
           MOVE 4 TO CBLC-EX-PAYLOAD-SIZE
           MOVE 942785999 TO CBLC-EX-TYPE-ID
           MOVE 942785999 TO CBLC-EX-DYNAMIC-TYPE-ID
           MOVE 110 TO CBLC-EX-SOURCE-LINE
           MOVE 808241889 TO CBLC-EX-SOURCE-FILE-ID
           MOVE 21 TO CBLC-EX-SOURCE-COLUMN
           MOVE 'Y' TO CBLC-EX-PAYLOAD-OWNER
           MOVE 'Y' TO CBLC-EX-ACTIVE
           MOVE 'N' TO CBLC-EX-RAISING
           GOBACK
           COMPUTE F-RESULT = 0
           COMPUTE F-INDEX = F-SOURCE-LENGTH
           END-IF
           END-IF
           END-IF
           END-PERFORM.
           IF F-SEEN-DIGIT = 0
           COMPUTE F-ERROR-CODE = 1
           IF CBLC-EX-RAISING = 'Y' OR CBLC-EX-CLEANING = 'Y'
               MOVE 942785999 TO CBLC-EX-SECONDARY-TYPE-ID
               MOVE 120 TO CBLC-EX-SECONDARY-SOURCE-LINE
               MOVE 9 TO CBLC-EX-SECONDARY-SOURCE-COLUMN
               PERFORM CBLC-TERMINATE
           END-IF
           MOVE 'Y' TO CBLC-EX-RAISING
           MOVE F-ERROR TO CBLC-EX-PAYLOAD-INVALID-ARGUMENT
           MOVE 4 TO CBLC-EX-PAYLOAD-SIZE
           MOVE 942785999 TO CBLC-EX-TYPE-ID
           MOVE 942785999 TO CBLC-EX-DYNAMIC-TYPE-ID
           MOVE 120 TO CBLC-EX-SOURCE-LINE
           MOVE 808241889 TO CBLC-EX-SOURCE-FILE-ID
           MOVE 9 TO CBLC-EX-SOURCE-COLUMN
           MOVE 'Y' TO CBLC-EX-PAYLOAD-OWNER
           MOVE 'Y' TO CBLC-EX-ACTIVE
           MOVE 'N' TO CBLC-EX-RAISING
           GOBACK
           END-IF.
           PERFORM UNTIL NOT (F-DECIMAL-PLACES > 0)
           COMPUTE F-RESULT = F-RESULT / 10
           COMPUTE F-DECIMAL-PLACES = F-DECIMAL-PLACES - 1
           END-PERFORM.
           IF F-NEGATIVE = 1
           COMPUTE F-RESULT = 0 - F-RESULT
           END-IF.
           MOVE F-RESULT TO CBLC-RETURN-F.
           GOBACK.
           GOBACK.

       CBLC-TERMINATE.
           DISPLAY "Fatal CBL-C double exception"
           DISPLAY "Original exception type: " CBLC-EX-TYPE-ID
           DISPLAY "Original exception file ID: " CBLC-EX-SOURCE-FILE-ID
           DISPLAY "Original exception line: " CBLC-EX-SOURCE-LINE
           DISPLAY "Original exception column: " CBLC-EX-SOURCE-COLUMN
           DISPLAY "Secondary exception type: " CBLC-EX-SECONDARY-TYPE-ID
           DISPLAY "Secondary exception line: " CBLC-EX-SECONDARY-SOURCE-LINE
           DISPLAY "Secondary exception column: " CBLC-EX-SECONDARY-SOURCE-COLUMN
           STOP RUN.

       END PROGRAM CBLC-STRTOD.

