       IDENTIFICATION DIVISION.
       PROGRAM-ID. CBLC-ABS.
       DATA DIVISION.
       LINKAGE SECTION.
       01 LNK-OPERAND PIC S9(18) COMP-5.
       01 LNK-RESULT PIC S9(18) COMP-5.
       01 LNK-STATUS PIC 9.
       PROCEDURE DIVISION USING BY REFERENCE LNK-OPERAND
           BY REFERENCE LNK-RESULT BY REFERENCE LNK-STATUS.
       MAIN.
           MOVE 0 TO LNK-STATUS.
           MOVE LNK-OPERAND TO LNK-RESULT.
           IF LNK-RESULT < 0
               COMPUTE LNK-RESULT = 0 - LNK-RESULT
                   ON SIZE ERROR
                       MOVE 1 TO LNK-STATUS
                       MOVE 0 TO LNK-RESULT
               END-COMPUTE
           END-IF.
           GOBACK.
       END PROGRAM CBLC-ABS.
