       IDENTIFICATION DIVISION.
       PROGRAM-ID. CBLC-ISALPHA.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 CURRENT-CHAR PIC X VALUE SPACE.
       LINKAGE SECTION.
       01 LNK-CHAR PIC X.
       01 LNK-RESULT PIC 9(9).
       PROCEDURE DIVISION USING BY REFERENCE LNK-CHAR
           BY REFERENCE LNK-RESULT.
       MAIN.
           MOVE 0 TO LNK-RESULT.
           MOVE LNK-CHAR TO CURRENT-CHAR.
           IF CURRENT-CHAR >= "A" AND CURRENT-CHAR <= "Z"
               MOVE 1 TO LNK-RESULT
           ELSE
               IF CURRENT-CHAR >= "a" AND CURRENT-CHAR <= "z"
                   MOVE 1 TO LNK-RESULT
               END-IF
           END-IF.
           GOBACK.
       END PROGRAM CBLC-ISALPHA.
