       IDENTIFICATION DIVISION.
       PROGRAM-ID. CBLC-STRNLEN-STRING.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 ACTUAL-LENGTH PIC 9(9) VALUE 000000000.
       01 REQUEST-LIMIT PIC 9(9) VALUE 000000000.
       LINKAGE SECTION.
       01 LNK-SOURCE.
          05 LNK-SOURCE-LEN PIC 9(4) COMP.
          05 LNK-SOURCE-BUF PIC X(255).
       01 LNK-REQUEST PIC S9(9) COMP-5.
       01 LNK-RESULT PIC 9(9).
       PROCEDURE DIVISION USING BY REFERENCE LNK-SOURCE
           BY VALUE LNK-REQUEST BY REFERENCE LNK-RESULT.
       MAIN.
           MOVE LNK-SOURCE-LEN TO ACTUAL-LENGTH.
           IF ACTUAL-LENGTH > 255
               MOVE 255 TO ACTUAL-LENGTH
           END-IF.
           MOVE LNK-REQUEST TO REQUEST-LIMIT.
           IF REQUEST-LIMIT < 0
               MOVE 0 TO REQUEST-LIMIT
           END-IF.
           IF REQUEST-LIMIT > 255
               MOVE 255 TO REQUEST-LIMIT
           END-IF.
           IF REQUEST-LIMIT < ACTUAL-LENGTH
               MOVE REQUEST-LIMIT TO ACTUAL-LENGTH
           END-IF.
           MOVE ACTUAL-LENGTH TO LNK-RESULT.
           GOBACK.
       END PROGRAM CBLC-STRNLEN-STRING.
