       IDENTIFICATION DIVISION.
       PROGRAM-ID. CBLC-POWEROF.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 EXP-INTEGER USAGE COMP-2 VALUE 0.
       01 EXP-FRACTION USAGE COMP-2 VALUE 0.
       01 FRACTION-TOLERANCE USAGE COMP-2 VALUE 0.0000000000001.
       LINKAGE SECTION.
       01 LNK-BASE USAGE COMP-2.
       01 LNK-EXPONENT USAGE COMP-2.
       01 LNK-RESULT USAGE COMP-2.
       01 LNK-STATUS PIC 9.
       PROCEDURE DIVISION USING BY REFERENCE LNK-BASE
           BY REFERENCE LNK-EXPONENT BY REFERENCE LNK-RESULT
           BY REFERENCE LNK-STATUS.
       MAIN.
           MOVE 0 TO LNK-STATUS.
           IF LNK-BASE = 0 AND LNK-EXPONENT <= 0
               MOVE 1 TO LNK-STATUS
               MOVE 0 TO LNK-RESULT
               GOBACK
           END-IF.
           MOVE FUNCTION INTEGER(LNK-EXPONENT) TO EXP-INTEGER.
           COMPUTE EXP-FRACTION = FUNCTION ABS(LNK-EXPONENT - EXP-INTEGER).
           IF LNK-BASE < 0 AND EXP-FRACTION > FRACTION-TOLERANCE
               MOVE 1 TO LNK-STATUS
               MOVE 0 TO LNK-RESULT
               GOBACK
           END-IF.
           COMPUTE LNK-RESULT = LNK-BASE ** LNK-EXPONENT
               ON SIZE ERROR
                   MOVE 1 TO LNK-STATUS
                   MOVE 0 TO LNK-RESULT
           END-COMPUTE.
           GOBACK.
       END PROGRAM CBLC-POWEROF.
