       IDENTIFICATION DIVISION.
       PROGRAM-ID. CBLC-TOUPPER-STRING.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 IDX PIC 9(9) VALUE 000000000.
       01 TARGET-LIMIT PIC 9(9) VALUE 000000000.
       01 CURRENT-CHAR PIC X VALUE SPACE.
       LINKAGE SECTION.
       01 LNK-TARGET.
          05 LNK-TARGET-LEN PIC 9(4) COMP.
          05 LNK-TARGET-BUF PIC X(255).
       01 LNK-STATUS PIC 9(9).
       PROCEDURE DIVISION USING BY REFERENCE LNK-TARGET
           BY REFERENCE LNK-STATUS.
       MAIN.
           MOVE 0 TO LNK-STATUS.
           MOVE LNK-TARGET-LEN TO TARGET-LIMIT.
           IF TARGET-LIMIT > 255
               MOVE 255 TO TARGET-LIMIT
           END-IF.
           MOVE 0 TO IDX.
           PERFORM VARYING IDX FROM 1 BY 1 UNTIL IDX > TARGET-LIMIT
               IF LNK-TARGET-BUF(IDX:1) = LOW-VALUE
                   EXIT PERFORM
               END-IF
               MOVE LNK-TARGET-BUF(IDX:1) TO CURRENT-CHAR
               INSPECT CURRENT-CHAR CONVERTING "abcdefghijklmnopqrstuvwxyz"
                   TO "ABCDEFGHIJKLMNOPQRSTUVWXYZ"
               MOVE CURRENT-CHAR TO LNK-TARGET-BUF(IDX:1)
           END-PERFORM.
           GOBACK.
       END PROGRAM CBLC-TOUPPER-STRING.
