       IDENTIFICATION DIVISION.
       PROGRAM-ID. CBLC-FABS.
       DATA DIVISION.
       LINKAGE SECTION.
       01 LNK-OPERAND USAGE COMP-2.
       01 LNK-RESULT USAGE COMP-2.
       01 LNK-STATUS PIC 9.
       PROCEDURE DIVISION USING BY REFERENCE LNK-OPERAND
           BY REFERENCE LNK-RESULT BY REFERENCE LNK-STATUS.
       MAIN.
           MOVE 0 TO LNK-STATUS.
           COMPUTE LNK-RESULT = FUNCTION ABS(LNK-OPERAND).
           GOBACK.
       END PROGRAM CBLC-FABS.
