       IDENTIFICATION DIVISION.
       PROGRAM-ID. CBLC-STRCAT.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 IDX PIC 9(9) VALUE 000000000.
       01 DEST-LIMIT PIC 9(9) VALUE 000000000.
       01 LEFT-LIMIT PIC 9(9) VALUE 000000000.
       01 RIGHT-LIMIT PIC 9(9) VALUE 000000000.
       01 DEST-OFFSET PIC 9(9) VALUE 000000000.
       LINKAGE SECTION.
       01 LNK-DESTINATION PIC X(255).
       01 LNK-DESTINATION-LENGTH PIC S9(9) COMP-5.
       01 LNK-LEFT PIC X(255).
       01 LNK-LEFT-LENGTH PIC S9(9) COMP-5.
       01 LNK-RIGHT PIC X(255).
       01 LNK-RIGHT-LENGTH PIC S9(9) COMP-5.
       01 LNK-STATUS PIC 9(9).
       01 LNK-RESULT-LENGTH PIC 9(9).
       PROCEDURE DIVISION USING BY REFERENCE LNK-DESTINATION
           BY VALUE LNK-DESTINATION-LENGTH BY REFERENCE LNK-LEFT
           BY VALUE LNK-LEFT-LENGTH BY REFERENCE LNK-RIGHT
           BY VALUE LNK-RIGHT-LENGTH BY REFERENCE LNK-STATUS
           BY REFERENCE LNK-RESULT-LENGTH.
       MAIN.
           MOVE 0 TO LNK-STATUS.
           MOVE 0 TO LNK-RESULT-LENGTH.
           MOVE LNK-DESTINATION-LENGTH TO DEST-LIMIT.
           IF DEST-LIMIT > 255
               MOVE 255 TO DEST-LIMIT
           END-IF.
           MOVE LNK-LEFT-LENGTH TO LEFT-LIMIT.
           IF LEFT-LIMIT > 255
               MOVE 255 TO LEFT-LIMIT
           END-IF.
           MOVE LNK-RIGHT-LENGTH TO RIGHT-LIMIT.
           IF RIGHT-LIMIT > 255
               MOVE 255 TO RIGHT-LIMIT
           END-IF.
           MOVE 0 TO DEST-OFFSET.
           MOVE 0 TO IDX.
           PERFORM VARYING IDX FROM 1 BY 1 UNTIL IDX > DEST-LIMIT
               IF LNK-DESTINATION(IDX:1) NOT = SPACE
                   MOVE IDX TO DEST-OFFSET
               END-IF
           END-PERFORM.
           MOVE DEST-OFFSET TO LNK-RESULT-LENGTH.
           ADD 1 TO DEST-OFFSET.
           IF DEST-OFFSET > DEST-LIMIT
               MOVE DEST-LIMIT TO DEST-OFFSET
           END-IF.
           MOVE 0 TO IDX.
           PERFORM VARYING IDX FROM 1 BY 1 UNTIL IDX > LEFT-LIMIT
               IF LNK-RESULT-LENGTH >= DEST-LIMIT
                   MOVE 1 TO LNK-STATUS
                   EXIT PERFORM
               END-IF
               ADD 1 TO LNK-RESULT-LENGTH
               MOVE LNK-LEFT(IDX:1) TO LNK-DESTINATION(LNK-RESULT-LENGTH:1)
           END-PERFORM.
           IF LNK-STATUS = 0
               MOVE 0 TO IDX
               PERFORM VARYING IDX FROM 1 BY 1 UNTIL IDX > RIGHT-LIMIT
                   IF LNK-RESULT-LENGTH >= DEST-LIMIT
                       MOVE 1 TO LNK-STATUS
                       EXIT PERFORM
                   END-IF
                   ADD 1 TO LNK-RESULT-LENGTH
                   MOVE LNK-RIGHT(IDX:1) TO LNK-DESTINATION(LNK-RESULT-LENGTH:1)
               END-PERFORM
           END-IF.
           IF LNK-RESULT-LENGTH > DEST-LIMIT
               MOVE DEST-LIMIT TO LNK-RESULT-LENGTH
           END-IF.
           GOBACK.
       END PROGRAM CBLC-STRCAT.
