       IDENTIFICATION DIVISION.
       PROGRAM-ID. CBLC-ISDIGIT.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 CURRENT-CHAR PIC X VALUE SPACE.
       LINKAGE SECTION.
       01 LNK-CHAR PIC X.
       01 LNK-RESULT PIC 9(9).
       PROCEDURE DIVISION USING BY REFERENCE LNK-CHAR
           BY REFERENCE LNK-RESULT.
       MAIN.
           MOVE 0 TO LNK-RESULT.
           MOVE LNK-CHAR TO CURRENT-CHAR.
           IF CURRENT-CHAR >= "0" AND CURRENT-CHAR <= "9"
               MOVE 1 TO LNK-RESULT
           END-IF.
           GOBACK.
       END PROGRAM CBLC-ISDIGIT.
