       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROJECT-SCHEDULER-MAIN.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
MAIN.
       CALL 'PROJECT-SCHEDULER-PRESENTER'.
       STOP RUN.
       END PROGRAM PROJECT-SCHEDULER-MAIN.
