       IDENTIFICATION DIVISION.
       PROGRAM-ID. MINIMAL.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 RESULT PIC X(3).
       PROCEDURE DIVISION.
MAIN.
           MOVE "42" TO RESULT
           MOVE RESULT TO RESULT
           STOP RUN.
