       IDENTIFICATION DIVISION.
       PROGRAM-ID. MULTI-MODULE-MAIN.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 ACCUMULATOR PIC 9(4) VALUE 0000.
       01 DISPLAY-BUFFER PIC Z(4).
       PROCEDURE DIVISION.
MAIN.
       MOVE 0 TO ACCUMULATOR.
       CALL 'SHOW-BANNER'.
       PERFORM ADD-ONCE.
       MOVE ACCUMULATOR TO DISPLAY-BUFFER.
       DISPLAY DISPLAY-BUFFER.
       STOP RUN.

ADD-ONCE.
       ADD 1 TO ACCUMULATOR.
       EXIT.
       END PROGRAM MULTI-MODULE-MAIN.
