       IDENTIFICATION DIVISION.
       PROGRAM-ID. SHOW-BANNER.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WORKER-MESSAGE PIC X(12) VALUE "WORKER READY".
       PROCEDURE DIVISION.
MAIN.
       DISPLAY WORKER-MESSAGE.
       GOBACK.
       END PROGRAM SHOW-BANNER.
