       IDENTIFICATION DIVISION.
       PROGRAM-ID. RETURN-NUMERIC.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 ADDEND-A PIC 9(4) VALUE 0012.
       01 ADDEND-B PIC 9(4) VALUE 0030.
       01 SUM-RESULT PIC 9(5) VALUE 00000.
       01 DISPLAY-BUFFER PIC Z(5).
       PROCEDURE DIVISION.
MAIN.
       CALL 'COMPUTE-SUM' USING BY REFERENCE ADDEND-A
           BY REFERENCE ADDEND-B BY REFERENCE SUM-RESULT.
       MOVE SUM-RESULT TO DISPLAY-BUFFER.
       DISPLAY DISPLAY-BUFFER.
       STOP RUN.
       END PROGRAM RETURN-NUMERIC.

       IDENTIFICATION DIVISION.
       PROGRAM-ID. COMPUTE-SUM.
       DATA DIVISION.
       LINKAGE SECTION.
       01 LNK-ADDEND-A PIC 9(4).
       01 LNK-ADDEND-B PIC 9(4).
       01 LNK-SUM-RESULT PIC 9(5).
       PROCEDURE DIVISION USING LNK-ADDEND-A LNK-ADDEND-B LNK-SUM-RESULT.
       COMPUTE LNK-SUM-RESULT = LNK-ADDEND-A + LNK-ADDEND-B.
       GOBACK.
       END PROGRAM COMPUTE-SUM.
