       IDENTIFICATION DIVISION.
       PROGRAM-ID. RETURN-BOOLEAN.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 CANDIDATE-VALUE PIC 9(4) VALUE 0009.
       01 REMAINDER-VALUE PIC 9(1) VALUE 0.
       01 IS-EVEN-RESULT PIC X VALUE 'N'.
       PROCEDURE DIVISION.
MAIN.
       CALL 'IS-EVEN' USING BY REFERENCE CANDIDATE-VALUE
           BY REFERENCE REMAINDER-VALUE BY REFERENCE IS-EVEN-RESULT.
       IF IS-EVEN-RESULT = 'Y'
           DISPLAY "EVEN"
       ELSE
           DISPLAY "ODD"
       END-IF.
       STOP RUN.
       END PROGRAM RETURN-BOOLEAN.

       IDENTIFICATION DIVISION.
       PROGRAM-ID. IS-EVEN.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WORK-QUOTIENT PIC 9(4).
       LINKAGE SECTION.
       01 LNK-CANDIDATE-VALUE PIC 9(4).
       01 LNK-REMAINDER-VALUE PIC 9(1).
       01 LNK-IS-EVEN-RESULT PIC X.
       PROCEDURE DIVISION USING LNK-CANDIDATE-VALUE LNK-REMAINDER-VALUE
           LNK-IS-EVEN-RESULT.
       DIVIDE LNK-CANDIDATE-VALUE BY 2 GIVING WORK-QUOTIENT
           REMAINDER LNK-REMAINDER-VALUE.
       IF LNK-REMAINDER-VALUE = 0
           MOVE 'Y' TO LNK-IS-EVEN-RESULT
       ELSE
           MOVE 'N' TO LNK-IS-EVEN-RESULT
       END-IF.
       GOBACK.
       END PROGRAM IS-EVEN.
