       IDENTIFICATION DIVISION.
       PROGRAM-ID. RETURN-CHARACTER.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 CURRENT-GRADE PIC X VALUE 'C'.
       PROCEDURE DIVISION.
MAIN.
       MOVE 'A' TO CURRENT-GRADE.
       CALL 'FETCH-GRADE' USING BY REFERENCE CURRENT-GRADE.
       DISPLAY CURRENT-GRADE.
       STOP RUN.
       END PROGRAM RETURN-CHARACTER.

       IDENTIFICATION DIVISION.
       PROGRAM-ID. FETCH-GRADE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 STORED-GRADE PIC X VALUE 'A'.
       LINKAGE SECTION.
       01 LNK-CURRENT-GRADE PIC X.
       PROCEDURE DIVISION USING LNK-CURRENT-GRADE.
       MOVE STORED-GRADE TO LNK-CURRENT-GRADE.
       GOBACK.
       END PROGRAM FETCH-GRADE.
