       IDENTIFICATION DIVISION.
       PROGRAM-ID. REVERSE-CONTROL-FLOW.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 CONTROL-FLAG PIC X VALUE 'N'.
       01 PROGRESS-METER PIC 9(4) VALUE 0000.
       01 PROGRESS-LIMIT PIC 9(4) VALUE 0010.
       01 PROGRESS-INDEX PIC 9(4) VALUE 0000.
       01 OUTPUT-VALUE PIC 9(4) VALUE 0000.
       PROCEDURE DIVISION.
MAIN.
       IF NOT CONTROL-FLAG = 'Y'
           PERFORM UNTIL PROGRESS-METER > PROGRESS-LIMIT
               MOVE 11 TO PROGRESS-METER
           END-PERFORM
           MOVE PROGRESS-METER TO OUTPUT-VALUE
       ELSE
           PERFORM VARYING PROGRESS-INDEX FROM 0 BY 1 UNTIL PROGRESS-INDEX >= PROGRESS-LIMIT
               MOVE PROGRESS-INDEX TO OUTPUT-VALUE
           END-PERFORM
       END-IF
       DISPLAY OUTPUT-VALUE.
       STOP RUN.
NEXT-PARAGRAPH.
       MOVE 'Y' TO CONTROL-FLAG.
       STOP RUN.
       END PROGRAM REVERSE-CONTROL-FLOW.
