       IDENTIFICATION DIVISION.
       PROGRAM-ID. REVERSE-GROUP-ITEMS.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 CUSTOMER-DETAIL.
           05 CUSTOMER-ID PIC X(8).
           05 CUSTOMER-NAME PIC X(24).
           05 CUSTOMER-BALANCE PIC 9(7)V99.
       01 CUSTOMER-STATUS PIC X VALUE 'N'.
       PROCEDURE DIVISION.
MAIN.
       MOVE '00001234' TO CUSTOMER-ID.
       MOVE 'ALPHA' TO CUSTOMER-NAME.
       MOVE 12345 TO CUSTOMER-BALANCE.
       MOVE 'Y' TO CUSTOMER-STATUS.
       STOP RUN.
       END PROGRAM REVERSE-GROUP-ITEMS.
