       IDENTIFICATION DIVISION.
       PROGRAM-ID. REVERSE-COPYBOOK.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       COPY CUSTOMER-STATUS.
       01 STATE-CODE PIC X VALUE 'A'.
       01 BUFFER-NAME PIC X(8).
       PROCEDURE DIVISION.
MAIN.
       STOP RUN.
       END PROGRAM REVERSE-COPYBOOK.
