       IDENTIFICATION DIVISION.
       PROGRAM-ID. REVERSE-STRING-LENGTH-METADATA.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 SHARED-ARG PIC X(5).
       PROCEDURE DIVISION.
MAIN.
       MOVE "A" TO SHARED-ARG.
       STOP RUN.
       END PROGRAM REVERSE-STRING-LENGTH-METADATA.
