       IDENTIFICATION DIVISION.
       PROGRAM-ID. REVERSE-COPYBOOK.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       COPY CUSTOMER-STATUS REPLACING ==CUSTOMER-NAME== BY ==CLIENT-NAME==
             WORD CUSTOMER-STATUS OF CUSTOMER-RECORD BY CLIENT-STATUS
             LEADING ==CUSTOMER-== BY ==CLIENT-==.
       01 STATE-CODE PIC X VALUE 'A'.
       01 BUFFER-NAME PIC X(8).
       PROCEDURE DIVISION.
MAIN.
       STOP RUN.
       END PROGRAM REVERSE-COPYBOOK.
