       IDENTIFICATION DIVISION.
       PROGRAM-ID. REVERSE-CONSTRUCTS.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 EOF-FLAG PIC X VALUE 'N'.
       01 OUTPUT-RECORD PIC X(1).
       PROCEDURE DIVISION.
MAIN.
       OPEN INPUT INPUT-FILE.
       PERFORM UNTIL EOF-FLAG == 'Y'
           READ INPUT-FILE INTO OUTPUT-RECORD
           IF EOF-FLAG == 'N'
               WRITE OUTPUT-FILE FROM OUTPUT-RECORD.
           ELSE
               MOVE 'Y' TO EOF-FLAG.
           END-IF
       END-PERFORM
       CLOSE INPUT-FILE.
       STOP RUN.
